return {
  {
    "echasnovski/mini.pick",
    lazy = true,
    keys = {"<leader>p", ":Pick files<cr>"},
    config = function()
      require("mini.pick").setup()
      vim.keymap.set("n", "<leader>p", ":Pick files<cr>")
    end,
  },
  {
    "echasnovski/mini.files",
    lazy = true,
    keys = {"<leader>f", ":lua MiniFiles.open()<cr>"},
    config = function()
      require("mini.files").setup()
      vim.keymap.set("n", "<leader>f", ":lua MiniFiles.open()<cr>")
    end,
  },
  {
    "echasnovski/mini.pairs",
    lazy = true,
    event = {'InsertEnter'},
    opts = {},
  },
    {
    "goolord/alpha-nvim",
    lazy = false,
    event = "VimEnter",
    dependencies = {{"nvim-tree/nvim-web-devicons", lazy = true}},
    config = function()
      local startify = require("alpha.themes.startify")
      startify.section.header.val = {
        [[                                                                       ]],
        [[                                                                     ]],
        [[       ████ ██████           █████      ██                     ]],
        [[      ███████████             █████                             ]],
        [[      █████████ ███████████████████ ███   ███████████   ]],
        [[     █████████  ███    █████████████ █████ ██████████████   ]],
        [[    █████████ ██████████ █████████ █████ █████ ████ █████   ]],
        [[  ███████████ ███    ███ █████████ █████ █████ ████ █████  ]],
        [[ ██████  █████████████████████ ████ █████ █████ ████ ██████ ]],
        [[                                                                       ]],
      }
      startify.file_icons.provider = "devicons"
      require("alpha").setup(startify.config)
    end,
  },
}
